## ✔️ Revising the Select Query I
### 문제
Query all columns for all American cities in the CITY table with populations larger than 100000.  The CountryCode for America is USA. The CITY table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg)
### 접근
- 100,000명 이상의 인구 & countrycode가 USA인 데이터만 where로 필터링
### 풀이

In [1]:
"""
SELECT *
FROM city
WHERE population > 100000 
AND countrycode = 'USA';
"""

"\nSELECT *\nFROM city\nWHERE population > 100000 \nAND countrycode = 'USA';\n"

## ✔️ Revising the Select Query II
### 문제
Query the NAME field for all American cities in the CITY table with populations larger than 120000. The CountryCode for America is USA. The CITY table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg)
### 접근
- countrycode가 usa & 인구가 120,000초과인 것만 where로 필터링
- name 컬럼만 조회
### 풀이

In [2]:
"""
SELECT name
FROM city
WHERE population > 120000
AND countrycode = 'usa';
"""

"\nSELECT name\nFROM city\nWHERE population > 120000\nAND countrycode = 'usa';\n"

## ✔️ Select All
### 문제
Query all columns (attributes) for every row in the CITY table. The CITY table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg)
### 접근
- city테이블에 있는 모든 컬럼 조회
### 풀이

In [3]:
"""
SELECT *
FROM city;
"""

'\nSELECT *\nFROM city;\n'

## ✔️ Select By ID
### 문제
Query all columns for a city in CITY with the ID 1661. The CITY table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg)
### 접근
- id가 1661인 것만 where로 필터링
### 풀이

In [4]:
"""
SELECT *
FROM city
WHERE id = 1661;
"""

'\nSELECT *\nFROM city\nWHERE id = 1661;\n'

## ✔️ Japanese Cities' Attributes
### 문제
Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN. The CITY table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg)
### 접근
- countrycode가 jpn인 것만 where로 필터링
### 풀이

In [5]:
""" 
SELECT *
FROM city
WHERE countrycode = 'jpn';
"""

" \nSELECT *\nFROM city\nWHERE countrycode = 'jpn';\n"

## ✔️ Japanese Cities' Names
### 문제
Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN. The CITY table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg)
### 접근
- countrycode가 jpn인 것만 where로 필터링
- name만 조회
### 풀이

In [6]:
""" 
SELECT name
FROM city
WHERE countrycode = 'jpn';
"""

" \nSELECT name\nFROM city\nWHERE countrycode = 'jpn';\n"

## ✔️ Weather Observation Station 1
### 문제
Query a list of CITY and STATE from the STATION table.  
The STATION table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg)  
where LAT_N is the northern latitude and LONG_W is the western longitude.
### 접근
- city, state 컬럼만 조회
### 풀이

In [7]:
""" 
SELECT city, state
FROM station;
"""

' \nSELECT city, state\nFROM station;\n'

## ✔️ Weather Observation Station 3
### 문제
Query a list of CITY names from STATION for cities that have an even ID number. Print the results in any order, but exclude duplicates from the answer.  
The STATION table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg)  
where LAT_N is the northern latitude and LONG_W is the western longitude.
### 접근
- id가 짝수( id % 2 = 0 )인 것만 필터링
- 중복 없이( distinct ) city 컬럼만 조회

In [8]:
"""
SELECT DISTINCT city
FROM station
WHERE id % 2 = 0;
"""

'\nSELECT DISTINCT city\nFROM station\nWHERE id % 2 = 0;\n'

## ✔️ Weather Observation Station 4
### 문제
Find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.  
The STATION table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg)  
where LAT_N is the northern latitude and LONG_W is the western longitude.  
For example, if there are three records in the table with CITY values 'New York', 'New York', 'Bengalaru', there are 2 different city names: 'New York' and 'Bengalaru'.  
The query returns 1, because **"total number of records - number of unique city names = 3 - 2 = 1"**
### 접근
- 중복 허용한 city 수 count해서 total number of records
- 중복없이 city 수 count해서 number of unique city names
- 두 변수 뺸 값 출력

In [9]:
"""
SELECT COUNT(city) - COUNT(DISTINCT city)
FROM station;
 """

'\nSELECT COUNT(city) - COUNT(DISTINCT city)\nFROM station;\n '

## ✔️ Weather Observation Station 5
### 문제
Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.  
The STATION table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg)  
where LAT_N is the northern latitude and LONG_W is the western longitude.  
**Sample Input**  
For example, CITY has four entries: DEF, ABC, PQRS and WXY.  
**Explanation**  
When ordered alphabetically, the CITY names are listed as ABC, DEF, PQRS, and WXY, with lengths 3, 3, 4, and 3. The longest name is PQRS, but there are 3 options for shortest named city. Choose ABC, because it comes first alphabetically.  
**Note**  
You can write two separate queries to get the desired output. It need not be a single query.
### 접근
- length로 city의 글자 수 세서 l_city 컬럼 생성
- l_city 기준 asc, city 기준 asc 정렬해서 가장 짧은 도시 이름 길이 구함
- l_city 기준 desc, city 기준 asc 정렬해서 가장 긴 도시 이름 길이 구함
- city, l_city만 조회
### 풀이

In [10]:
"""
SELECT city, LENGTH(city) AS l_city
FROM station
ORDER BY l_city, city
LIMIT 1;
SELECT city, LENGTH(city) AS l_city
FROM station
ORDER BY l_city DESC, city
LIMIT 1;
"""

'\nSELECT city, LENGTH(city) AS l_city\nFROM station\nORDER BY l_city, city\nLIMIT 1;\nSELECT city, LENGTH(city) AS l_city\nFROM station\nORDER BY l_city DESC, city\nLIMIT 1;\n'

## ✔️ Weather Observation Station 6
### 문제
Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.  
Input Format  
The STATION table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg)  
where LAT_N is the northern latitude and LONG_W is the western longitude.
### 접근
- left함수로 가져온 city의 첫글자가 vowel인 것만 where, in 사용해서 필터링
- city만 조회
### 풀이

In [13]:
"""
SELECT DISTINCT city
FROM station
WHERE LEFT(city, 1) IN ('a','e','i','o','u');
"""

"\nSELECT DISTINCT city\nFROM station\nWHERE LEFT(city, 1) IN ('a','e','i','o','u');\n"

## ✔️ Weather Observation Station 7
### 문제
Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.  
**Input Format**  
The STATION table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg)  
where LAT_N is the northern latitude and LONG_W is the western longitude.
### 접근
- right함수로 city의 마지막 글자가 vowel인 것만 in, where로 필터링
- 중복없는 city 조회

In [12]:
"""
SELECT DISTINCT city
FROM station
WHERE RIGHT(city, 1) IN ('a','e','i','o','u');
"""

"\nSELECT DISTINCT city\nFROM station\nWHERE RIGHT(city, 1) IN ('a','e','i','o','u');\n"

## ✔️ Weather Observation Station 8
### 문제
Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.  
**Input Format**  
The STATION table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg)  
where LAT_N is the northern latitude and LONG_W is the western longitude.
### 접근
- left함수로 첫 글자가 모음 & right함수로 마지막 글자가 모음인 것만 in, where 사용해서 필터링
- 중복없이 city만 조회

In [14]:
"""
SELECT DISTINCT city
FROM station
WHERE LEFT(city, 1) IN ('a','e','i','o','u')
AND RIGHT(city, 1) IN ('a','e','i','o','u');
"""

"\nSELECT DISTINCT city\nFROM station\nWHERE LEFT(city, 1) IN ('a','e','i','o','u')\nAND RIGHT(city, 1) IN ('a','e','i','o','u');\n"

## ✔️ Weather Observation Station 9
### 문제
Query the list of CITY names from STATION that do not start with vowels. Your result cannot contain duplicates.  
**Input Format**  
The STATION table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg)  
where LAT_N is the northern latitude and LONG_W is the western longitude.
### 접근
- left함수로 첫 글자가 vowel이 아닌 것만 필터링하기 위해 not in, where 사용
- 중복없이 city만 조회
### 풀이

In [15]:
"""
SELECT DISTINCT city
FROM station
WHERE LEFT(city, 1) NOT IN ('a','e','i','o','u');
"""

"\nSELECT DISTINCT city\nFROM station\nWHERE LEFT(city, 1) NOT IN ('a','e','i','o','u');\n"

## ✔️ Weather Observation Station 10
### 문제
Query the list of CITY names from STATION that do not end with vowels. Your result cannot contain duplicates.   
**Input Format**  
The STATION table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg)  where LAT_N is the northern latitude and LONG_W is the western longitude.  
### 접근
- right함수로 마지막글자 가져와서 모음이 아닌 것만 not in, where 사용해서 필터링
- 중복없이 도시만 추출
### 풀이

In [16]:
"""
SELECT DISTINCT city
FROM station
WHERE RIGHT(city, 1) NOT IN ('a','e','i','o','u');
"""

"\nSELECT DISTINCT city\nFROM station\nWHERE RIGHT(city, 1) NOT IN ('a','e','i','o','u');\n"

## ✔️ Weather Observation Station 11
### 문제
Query the list of CITY names from STATION that either do not start with vowels or do not end with vowels. Your result cannot contain duplicates.  
**Input Format**  
The STATION table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg)  
where LAT_N is the northern latitude and LONG_W is the western longitude.  
### 접근
- left함수로 첫글자 가져와서 모음이 아닌 것 또는 right함수로 마지막글자 가져와서 모음이 아닌 것 not in, where 사용해서 필터링
- 중복없이 도시만 조회
### 풀이

In [18]:
"""SELECT DISTINCT city
FROM station
WHERE LEFT(city, 1) NOT IN ('a','e','i','o','u')
OR RIGHT(city, 1) NOT IN ('a','e','i','o','u');"""

"SELECT DISTINCT city\nFROM station\nWHERE LEFT(city, 1) NOT IN ('a','e','i','o','u')\nOR RIGHT(city, 1) NOT IN ('a','e','i','o','u');"

## ✔️ Weather Observation Station 12
### 문제
Query the list of CITY names from STATION that do not start with vowels and do not end with vowels. Your result cannot contain duplicates.   
**Input Format**  
The STATION table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg)  
where LAT_N is the northern latitude and LONG_W is the western longitude.
### 접근
- left함수로 첫글자 가져와서 모음 아닌 것 & right함수로 마지막글자 가져와서 모음 아닌 것 not in, where 사용해서 필터링
- 중복없이 도시만 조회
### 풀이

In [19]:
"""SELECT DISTINCT city
FROM station
WHERE LEFT(city, 1) NOT IN ('a','e','i','o','u')
AND RIGHT(city, 1) NOT IN ('a','e','i','o','u');"""

"SELECT DISTINCT city\nFROM station\nWHERE LEFT(city, 1) NOT IN ('a','e','i','o','u')\nAND RIGHT(city, 1) NOT IN ('a','e','i','o','u');"

## ✔️ Higher Than 75 Marks
### Problem
Query the Name of any student in STUDENTS who scored higher than  Marks. Order your output by the last three characters of each name. If two or more students both have names ending in the same last three characters (i.e.: Bobby, Robby, etc.), secondary sort them by ascending ID.  
**Input Format**  
The STUDENTS table is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/12896/1443815243-94b941f556-1.png)  
The Name column only contains uppercase (A-Z) and lowercase (a-z) letters.  
**Sample Input**  
![image](https://s3.amazonaws.com/hr-challenge-images/12896/1443815209-cf4b260993-2.png)  
**Explanation**  
Only Ashley, Julia, and Belvet have Marks > **75**. If you look at the last three characters of each of their names, there are no duplicates and 'ley' < 'lia' < 'vet'.
### My answer
- marks가 75 초과인 것만 where절로 필터링
- 이름만 조회
- right함수 사용해서 이름의 마지막 3자 기준 asc, id 기준 asc 정렬

In [20]:
"""SELECT name
FROM students
WHERE marks > 75
ORDER BY RIGHT(name, 3), id;"""

'SELECT name\nFROM students\nWHERE marks > 75\nORDER BY RIGHT(name, 3), id;'

## ✔️ Employee Names
### Problem
Write a query that prints a list of employee names (i.e.: the name attribute) from the Employee table in alphabetical order.  
**Input Format**  
The Employee table containing employee data for a company is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/19629/1458557872-4396838885-ScreenShot2016-03-21at4.27.13PM.png)  
where employee_id is an employee's ID number, name is their name, months is the total number of months they've been working for the company, and salary is their monthly salary.  
**Sample Input**  
![image](https://s3.amazonaws.com/hr-challenge-images/19629/1458558202-9a8721e44b-ScreenShot2016-03-21at4.32.59PM.png)
### My answer
- 직원 이름만 조회
- 이름 기준 asc 정렬

In [21]:
"""SELECT name
FROM employee
ORDER BY name;"""

'SELECT name\nFROM employee\nORDER BY name;'

## ✔️ Employee Salaries
### Problem
Write a query that prints a list of employee names (i.e.: the name attribute) for employees in Employee having a salary greater than  per month who have been employees for less than  months. Sort your result by ascending employee_id.  
**Input Format**  
The Employee table containing employee data for a company is described as follows:  
![image](https://s3.amazonaws.com/hr-challenge-images/19629/1458557872-4396838885-ScreenShot2016-03-21at4.27.13PM.png)  
where employee_id is an employee's ID number, name is their name, months is the total number of months they've been working for the company, and salary is the their monthly salary.  
**Sample Input**  
![image](https://s3.amazonaws.com/hr-challenge-images/19630/1458558612-af3da3ceb7-ScreenShot2016-03-21at4.32.59PM.png)  
**Explanation**  
Angela has been an employee for **1** month and earns **$3443** per month.  
Michael has been an employee for **6** months and earns **$2017** per month.  
Todd has been an employee for **5** months and earns **$3396** per month.  
Joe has been an employee for **9** months and earns **$3573** per month.  
We order our output by ascending employee_id.
### My answer
- salary > $2000 & months < 10 인 것만 where로 필터링
- employee name만 조회
- employee_id 기준 asc 정렬

In [23]:
"""SELECT name
FROM employee
WHERE salary > 2000
AND months < 10
ORDER BY employee_id;"""

'SELECT name\nFROM employee\nWHERE salary > 2000\nAND months < 10\nORDER BY employee_id;'